[Killed] BlockStatement
src/components/Cart.jsx:8:37
 const Cart = ({ items, onIncreaseQuantity, onDecreaseQuantity, onCheckout }) => {
   const navigate = useNavigate();
 
-  const handleCheckoutClick = () => {
-    navigate('/checkout', { state: { items } });  // Pass cart items to Checkout component
-  };
+  const handleCheckoutClick = () => {};
 
   // Calculate total price
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/Cart.jsx:14:5
 
   // Calculate total price
   const total = items.reduce(
-    (acc, item) => acc + item.price * (item.quantity || 1),
+    () => undefined,
     0
   );
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/Cart.jsx:14:40
 
   // Calculate total price
   const total = items.reduce(
-    (acc, item) => acc + item.price * (item.quantity || 1),
+    (acc, item) => acc + item.price * (item.quantity && 1),
     0
   );
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/Cart.jsx:21:8
   return (
     <div className="container mx-auto p-6">
       <h1 className="text-4xl font-bold mb-8 text-center">Shopping Cart</h1>
-      {items.length === 0 ? (
+      {items.length !== 0 ? (
         <p className="text-center text-gray-600">Your cart is empty.</p>
       ) : (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Cart.jsx:21:8
   return (
     <div className="container mx-auto p-6">
       <h1 className="text-4xl font-bold mb-8 text-center">Shopping Cart</h1>
-      {items.length === 0 ? (
+      {true ? (
         <p className="text-center text-gray-600">Your cart is empty.</p>
       ) : (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Cart.jsx:38:38
                   <h2 className="text-xl font-semibold">{item.title}</h2>
                   <p className="text-gray-500 text-sm">{item.description}</p>
                   <p className="text-gray-700 mt-2 font-bold">
-                    ${(item.price * (item.quantity || 1)).toFixed(2)}
+                    ${(item.price * (false)).toFixed(2)}
                   </p>
                 </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Cart.jsx:38:38
                   <h2 className="text-xl font-semibold">{item.title}</h2>
                   <p className="text-gray-500 text-sm">{item.description}</p>
                   <p className="text-gray-700 mt-2 font-bold">
-                    ${(item.price * (item.quantity || 1)).toFixed(2)}
+                    ${(item.price * (true)).toFixed(2)}
                   </p>
                 </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/Cart.jsx:43:30
                 </div>
                 <div className="flex items-center">
                   <button
-                    onClick={() => onDecreaseQuantity(item)}
+                    onClick={() => undefined}
                     className="px-3 py-1 bg-red-500 text-white rounded hover:bg-red-600"
                   >
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Cart.jsx:48:51
                   >
                     -
                   </button>
-                  <span className="mx-3 text-lg">{item.quantity || 1}</span>
+                  <span className="mx-3 text-lg">{true}</span>
                   <button
                     onClick={() => onIncreaseQuantity(item)}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/Cart.jsx:48:51
                   >
                     -
                   </button>
-                  <span className="mx-3 text-lg">{item.quantity || 1}</span>
+                  <span className="mx-3 text-lg">{item.quantity && 1}</span>
                   <button
                     onClick={() => onIncreaseQuantity(item)}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/Cart.jsx:50:30
                   </button>
                   <span className="mx-3 text-lg">{item.quantity || 1}</span>
                   <button
-                    onClick={() => onIncreaseQuantity(item)}
+                    onClick={() => undefined}
                     className="px-3 py-1 bg-green-500 text-white rounded hover:bg-green-600"
                   >
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared
