[Killed] BooleanLiteral
src/components/AddItem.jsx:15:35
   const handleSubmit = async (e) => {
     e.preventDefault();
   
-    if (!title || !description || !price) {
+    if (!title || !description || price) {
       alert('Please fill in all required fields.');
       return;
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/AddItem.jsx:15:9
   const handleSubmit = async (e) => {
     e.preventDefault();
   
-    if (!title || !description || !price) {
+    if (!title && !description || !price) {
       alert('Please fill in all required fields.');
       return;
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/AddItem.jsx:16:13
     e.preventDefault();
   
     if (!title || !description || !price) {
-      alert('Please fill in all required fields.');
+      alert("");
       return;
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/AddItem.jsx:20:40
       return;
     }
   
-    const token = localStorage.getItem('access_token');
+    const token = localStorage.getItem("");
     console.log("🚀 JWT Token being sent:", token);
     
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/AddItem.jsx:23:17
     const token = localStorage.getItem('access_token');
     console.log("🚀 JWT Token being sent:", token);
     
-    if (!token) {
-      alert('You must be logged in to add an item.');
-      return;
-    }
+    if (!token) {}
   
     try {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/AddItem.jsx:24:13
     console.log("🚀 JWT Token being sent:", token);
     
     if (!token) {
-      alert('You must be logged in to add an item.');
+      alert("");
       return;
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ObjectLiteral
src/components/AddItem.jsx:37:30
           'Content-Type': 'application/json',
           Authorization: `Bearer ${token}`,
         },
-        body: JSON.stringify({
-          title,
-          description,
-          price,
-          // If your backend accepts an image, you'll need to switch to FormData
-        }),
+        body: JSON.stringify({}),
       });
   
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/AddItem.jsx:47:25
   
       const data = await response.json();
   
-      if (!response.ok) {
-        throw new Error(data.error || 'Failed to add item');
-      }
+      if (!response.ok) {}
   
       alert('Item added successfully!');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/AddItem.jsx:48:25
       const data = await response.json();
   
       if (!response.ok) {
-        throw new Error(data.error || 'Failed to add item');
+        throw new Error(data.error && 'Failed to add item');
       }
   
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/AddItem.jsx:48:25
       const data = await response.json();
   
       if (!response.ok) {
-        throw new Error(data.error || 'Failed to add item');
+        throw new Error(true);
       }
   
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/AddItem.jsx:54:11
       alert('Item added successfully!');
       
       // Call the callback with the new item data
-      if (onItemAdded) onItemAdded(data);
+      if (false) onItemAdded(data);
       
       // Navigate to /items
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/AddItem.jsx:54:11
       alert('Item added successfully!');
       
       // Call the callback with the new item data
-      if (onItemAdded) onItemAdded(data);
+      if (true) onItemAdded(data);
       
       // Navigate to /items
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/AddItem.jsx:58:19
       
       // Navigate to /items
       navigate('/items');
-    } catch (err) {
-      console.error(err);
-      alert('An error occurred: ' + err.message);
-    }
+    } catch (err) {}
   };
   
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/AddItem.jsx:64:36
     }
   };
   
-  const handleImageChange = (e) => {
-    setImage(e.target.files[0]);
-  };
+  const handleImageChange = (e) => {};
 
   return (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/AddItem.jsx:77:23
           <input
             type="text"
             value={title}
-            onChange={(e) => setTitle(e.target.value)}
+            onChange={() => undefined}
             className="w-full p-2 border border-gray-300 rounded"
             placeholder="Item Title"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/AddItem.jsx:98:23
           <input
             type="number"
             value={price}
-            onChange={(e) => setPrice(e.target.value)}
+            onChange={() => undefined}
             className="w-full p-2 border border-gray-300 rounded"
             placeholder="Item Price"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/AddItem.jsx:124:22
           </button>
           <button
             type="button"
-            onClick={() => navigate('/')}
+            onClick={() => undefined}
             className="bg-gray-600 hover:bg-gray-700 text-white font-bold py-2 px-4 rounded"
           >
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared
