[Killed] ConditionalExpression
src/components/Checkout.jsx:12:21
 const Checkout = ({ items, onProceed, setCart }) => {
   const navigate = useNavigate();
   const location = useLocation();
-  const cartItems = location.state?.items || []; // Get items from navigation state
+  const cartItems = false; // Get items from navigation state
 
   // Calculate total amount based on quantity and price
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Checkout.jsx:12:21
 const Checkout = ({ items, onProceed, setCart }) => {
   const navigate = useNavigate();
   const location = useLocation();
-  const cartItems = location.state?.items || []; // Get items from navigation state
+  const cartItems = true; // Get items from navigation state
 
   // Calculate total amount based on quantity and price
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArithmeticOperator
src/components/Checkout.jsx:16:30
 
   // Calculate total amount based on quantity and price
   const totalAmount = cartItems.reduce(
-    (total, item) => total + item.price * item.quantity,
+    (total, item) => total + item.price / item.quantity,
     0
   );
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArithmeticOperator
src/components/Checkout.jsx:16:22
 
   // Calculate total amount based on quantity and price
   const totalAmount = cartItems.reduce(
-    (total, item) => total + item.price * item.quantity,
+    (total, item) => total - item.price * item.quantity,
     0
   );
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/Checkout.jsx:21:46
   );
 
   // Loading state to indicate the purchase is processing
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
 
   // Shipping details state (basic example)
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:33:36
     email: ''
   });
 
-  const handleInputChange = (e) => {
-    const { name, value } = e.target;
-    setShippingDetails((prevState) => ({ ...prevState, [name]: value }));
-  };
+  const handleInputChange = (e) => {};
 
   // Converted handleProceed for asynchronous processing
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/Checkout.jsx:35:24
 
   const handleInputChange = (e) => {
     const { name, value } = e.target;
-    setShippingDetails((prevState) => ({ ...prevState, [name]: value }));
+    setShippingDetails(() => undefined);
   };
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/Checkout.jsx:40:18
 
   // Converted handleProceed for asynchronous processing
   const handleProceed = async () => {
-    setIsLoading(true);
+    setIsLoading(false);
     try {
       const result = await handlePay(cartItems, toast);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:41:9
   // Converted handleProceed for asynchronous processing
   const handleProceed = async () => {
     setIsLoading(true);
-    try {
-      const result = await handlePay(cartItems, toast);
-  
-      if (!result.success) {
-        if (result.reason === "PRICE_CHANGED") {
-          toast.error("Prices were updated. Please review your cart.");
-          setCart(result.updatedCart); // ⬅️ Update prices visually
-        }
-        setIsLoading(false);
-        return;
-      }
-  
-      // ✅ Clear cart only if purchase was successful
-      if (typeof window !== 'undefined') {
-        localStorage.removeItem("cart");
-      }
-      setCart([]);
-      navigate('/purchased');
-  
-    } catch (error) {
+    try {} catch (error) {
       toast.error('There was an error completing your purchase. Please try again.');
     } finally {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:44:28
     try {
       const result = await handlePay(cartItems, toast);
   
-      if (!result.success) {
-        if (result.reason === "PRICE_CHANGED") {
-          toast.error("Prices were updated. Please review your cart.");
-          setCart(result.updatedCart); // ⬅️ Update prices visually
-        }
-        setIsLoading(false);
-        return;
-      }
+      if (!result.success) {}
   
       // ✅ Clear cart only if purchase was successful
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/Checkout.jsx:45:13
       const result = await handlePay(cartItems, toast);
   
       if (!result.success) {
-        if (result.reason === "PRICE_CHANGED") {
+        if (result.reason !== "PRICE_CHANGED") {
           toast.error("Prices were updated. Please review your cart.");
           setCart(result.updatedCart); // ⬅️ Update prices visually
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:45:48
       const result = await handlePay(cartItems, toast);
   
       if (!result.success) {
-        if (result.reason === "PRICE_CHANGED") {
-          toast.error("Prices were updated. Please review your cart.");
-          setCart(result.updatedCart); // ⬅️ Update prices visually
-        }
+        if (result.reason === "PRICE_CHANGED") {}
         setIsLoading(false);
         return;
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Checkout.jsx:46:23
   
       if (!result.success) {
         if (result.reason === "PRICE_CHANGED") {
-          toast.error("Prices were updated. Please review your cart.");
+          toast.error("");
           setCart(result.updatedCart); // ⬅️ Update prices visually
         }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/Checkout.jsx:49:22
           toast.error("Prices were updated. Please review your cart.");
           setCart(result.updatedCart); // ⬅️ Update prices visually
         }
-        setIsLoading(false);
+        setIsLoading(true);
         return;
       }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Checkout.jsx:54:11
       }
   
       // ✅ Clear cart only if purchase was successful
-      if (typeof window !== 'undefined') {
+      if (false) {
         localStorage.removeItem("cart");
       }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:54:42
       }
   
       // ✅ Clear cart only if purchase was successful
-      if (typeof window !== 'undefined') {
-        localStorage.removeItem("cart");
-      }
+      if (typeof window !== 'undefined') {}
       setCart([]);
       navigate('/purchased');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Checkout.jsx:55:33
   
       // ✅ Clear cart only if purchase was successful
       if (typeof window !== 'undefined') {
-        localStorage.removeItem("cart");
+        localStorage.removeItem("");
       }
       setCart([]);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:60:21
       setCart([]);
       navigate('/purchased');
   
-    } catch (error) {
-      toast.error('There was an error completing your purchase. Please try again.');
-    } finally {
+    } catch (error) {} finally {
       setIsLoading(false);
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Checkout.jsx:62:15
   
     } catch (error) {
       toast.error('There was an error completing your purchase. Please try again.');
-    } finally {
-      setIsLoading(false);
-    }
+    } finally {}
   };
   
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/Checkout.jsx:74:8
     <div className="container mx-auto p-6">
       <h1 className="text-4xl font-bold text-center mb-8">Checkout</h1>
       
-      {cartItems.length === 0 ? (
+      {cartItems.length !== 0 ? (
         <p className="text-center text-gray-700">Your cart is empty.</p>
       ) : (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Checkout.jsx:74:8
     <div className="container mx-auto p-6">
       <h1 className="text-4xl font-bold text-center mb-8">Checkout</h1>
       
-      {cartItems.length === 0 ? (
+      {false ? (
         <p className="text-center text-gray-700">Your cart is empty.</p>
       ) : (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/Checkout.jsx:165:30
           <div className="w-full lg:w-1/3 bg-white shadow-md rounded-lg p-6">
             <h2 className="text-2xl font-semibold mb-4">Order Summary</h2>
             <div className="space-y-4">
-              {cartItems.map((item) => (
-                <div key={item.id} className="flex justify-between items-center">
-                  <div className="flex items-center">
-                    <img
-                      src={item.image}
-                      alt={item.title}
-                      className="w-16 h-16 object-cover rounded"
-                    />
-                    <div className="ml-4">
-                      <p className="font-medium">{item.title}</p>
-                      <p className="text-sm text-gray-500">Qty: {item.quantity}</p>
-                    </div>
-                  </div>
-                  <p className="font-bold">${(item.price * item.quantity).toFixed(2)}</p>
-                </div>
-              ))}
+              {cartItems.map(() => undefined)}
             </div>
             <hr className="my-4" />
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArithmeticOperator
src/components/Checkout.jsx:178:47
                       <p className="text-sm text-gray-500">Qty: {item.quantity}</p>
                     </div>
                   </div>
-                  <p className="font-bold">${(item.price * item.quantity).toFixed(2)}</p>
+                  <p className="font-bold">${(item.price / item.quantity).toFixed(2)}</p>
                 </div>
               ))}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Checkout.jsx:192:46
               disabled={isLoading}
               className="mt-6 w-full bg-green-600 text-white py-3 rounded hover:bg-green-700"
             >
-              {isLoading ? 'Processing...' : 'Pay'}
+              {isLoading ? 'Processing...' : ""}
             </button>
           </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared
