[Killed] BooleanLiteral
src/components/EditableItemCard.jsx:5:46
 import React, { useState } from 'react';
 
 const EditableItemCard = ({ item, API_BASE_URL, refreshInventory }) => {
-  const [isEditing, setIsEditing] = useState(false);
+  const [isEditing, setIsEditing] = useState(true);
   const [editPrice, setEditPrice] = useState(item.price);
   const [editQuantity, setEditQuantity] = useState(item.quantity);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/EditableItemCard.jsx:11:34
  
   console.log("🖼 item.image value:", item.image);
   console.log("🧾 item object:", item);
-  const handleSave = async () => {
-    try {
-      const token = localStorage.getItem('access_token');
-      const res = await fetch(`${API_BASE_URL}/api/items/${item.id}/`, {
-        method: 'PATCH',
-        headers: {
-          'Content-Type': 'application/json',
-          Authorization: `Bearer ${token}`
-        },
-        body: JSON.stringify({
-          price: editPrice,
-          quantity: editQuantity
-        })
-      });
-      if (res.ok) {
-        await refreshInventory();
-        setIsEditing(false);
-      } else {
-        console.error('Failed to update item');
-      }
-    } catch (err) {
-      console.error('Error while updating item:', err);
-    }
-  };
+  const handleSave = async () => {};
 
   return (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/EditableItemCard.jsx:12:9
   console.log("🖼 item.image value:", item.image);
   console.log("🧾 item object:", item);
   const handleSave = async () => {
-    try {
-      const token = localStorage.getItem('access_token');
-      const res = await fetch(`${API_BASE_URL}/api/items/${item.id}/`, {
-        method: 'PATCH',
-        headers: {
-          'Content-Type': 'application/json',
-          Authorization: `Bearer ${token}`
-        },
-        body: JSON.stringify({
-          price: editPrice,
-          quantity: editQuantity
-        })
-      });
-      if (res.ok) {
-        await refreshInventory();
-        setIsEditing(false);
-      } else {
-        console.error('Failed to update item');
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error('Error while updating item:', err);
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ObjectLiteral
src/components/EditableItemCard.jsx:16:18
       const token = localStorage.getItem('access_token');
       const res = await fetch(`${API_BASE_URL}/api/items/${item.id}/`, {
         method: 'PATCH',
-        headers: {
-          'Content-Type': 'application/json',
-          Authorization: `Bearer ${token}`
-        },
+        headers: {},
         body: JSON.stringify({
           price: editPrice,
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/EditableItemCard.jsx:18:26
         method: 'PATCH',
         headers: {
           'Content-Type': 'application/json',
-          Authorization: `Bearer ${token}`
+          Authorization: ``
         },
         body: JSON.stringify({
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/EditableItemCard.jsx:25:19
           quantity: editQuantity
         })
       });
-      if (res.ok) {
-        await refreshInventory();
-        setIsEditing(false);
-      } else {
+      if (res.ok) {} else {
         console.error('Failed to update item');
       }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/EditableItemCard.jsx:27:22
       });
       if (res.ok) {
         await refreshInventory();
-        setIsEditing(false);
+        setIsEditing(true);
       } else {
         console.error('Failed to update item');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/EditableItemCard.jsx:28:14
       if (res.ok) {
         await refreshInventory();
         setIsEditing(false);
-      } else {
-        console.error('Failed to update item');
-      }
+      } else {}
     } catch (err) {
       console.error('Error while updating item:', err);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/EditableItemCard.jsx:31:19
       } else {
         console.error('Failed to update item');
       }
-    } catch (err) {
-      console.error('Error while updating item:', err);
-    }
+    } catch (err) {}
   };
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/EditableItemCard.jsx:32:21
         console.error('Failed to update item');
       }
     } catch (err) {
-      console.error('Error while updating item:', err);
+      console.error("", err);
     }
   };
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/EditableItemCard.jsx:42:8
 
 
       {/* ✅ Display the item image if it exists */}
-      {item.image && (
-  <img
-    src={`/image/${item.image.replace(/^.*[\\/]/, '')}`} // removes any leading paths
-    alt="Item"
-    className="w-full h-40 object-cover rounded mb-3"
-  />
-)}
+      {true}
   
       <h3 className="font-bold text-lg">{item.title}</h3>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/EditableItemCard.jsx:42:8
 
 
       {/* ✅ Display the item image if it exists */}
-      {item.image && (
-  <img
-    src={`/image/${item.image.replace(/^.*[\\/]/, '')}`} // removes any leading paths
-    alt="Item"
-    className="w-full h-40 object-cover rounded mb-3"
-  />
-)}
+      {item.image || <img src={`/image/${item.image.replace(/^.*[\\/]/, '')}`} // removes any leading paths
+alt="Item" className="w-full h-40 object-cover rounded mb-3" />}
   
       <h3 className="font-bold text-lg">{item.title}</h3>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] Regex
src/components/EditableItemCard.jsx:44:39
       {/* ✅ Display the item image if it exists */}
       {item.image && (
   <img
-    src={`/image/${item.image.replace(/^.*[\\/]/, '')}`} // removes any leading paths
+    src={`/image/${item.image.replace(/.*[\\/]/, '')}`} // removes any leading paths
     alt="Item"
     className="w-full h-40 object-cover rounded mb-3"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] Regex
src/components/EditableItemCard.jsx:44:39
       {/* ✅ Display the item image if it exists */}
       {item.image && (
   <img
-    src={`/image/${item.image.replace(/^.*[\\/]/, '')}`} // removes any leading paths
+    src={`/image/${item.image.replace(/^.*[^\\/]/, '')}`} // removes any leading paths
     alt="Item"
     className="w-full h-40 object-cover rounded mb-3"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/EditableItemCard.jsx:56:69
       {isEditing ? (
         <>
           <p>
-            Price: <input type="number" value={editPrice} onChange={e => setEditPrice(e.target.value)} className="border px-2 py-1 rounded w-20" />
+            Price: <input type="number" value={editPrice} onChange={() => undefined} className="border px-2 py-1 rounded w-20" />
           </p>
           <p>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/EditableItemCard.jsx:59:75
             Price: <input type="number" value={editPrice} onChange={e => setEditPrice(e.target.value)} className="border px-2 py-1 rounded w-20" />
           </p>
           <p>
-            Quantity: <input type="number" value={editQuantity} onChange={e => setEditQuantity(e.target.value)} className="border px-2 py-1 rounded w-20" />
+            Quantity: <input type="number" value={editQuantity} onChange={() => undefined} className="border px-2 py-1 rounded w-20" />
           </p>
           <div className="mt-2 flex space-x-2">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/EditableItemCard.jsx:63:49
           </p>
           <div className="mt-2 flex space-x-2">
             <button onClick={handleSave} className="bg-green-600 text-white px-3 py-1 rounded">Save</button>
-            <button onClick={() => setIsEditing(false)} className="bg-gray-400 text-white px-3 py-1 rounded">Cancel</button>
+            <button onClick={() => setIsEditing(true)} className="bg-gray-400 text-white px-3 py-1 rounded">Cancel</button>
           </div>
         </>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/EditableItemCard.jsx:63:30
           </p>
           <div className="mt-2 flex space-x-2">
             <button onClick={handleSave} className="bg-green-600 text-white px-3 py-1 rounded">Save</button>
-            <button onClick={() => setIsEditing(false)} className="bg-gray-400 text-white px-3 py-1 rounded">Cancel</button>
+            <button onClick={() => undefined} className="bg-gray-400 text-white px-3 py-1 rounded">Cancel</button>
           </div>
         </>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/EditableItemCard.jsx:70:28
         <>
           <p>Price: ${item.price}</p>
           <p>Quantity: {item.quantity}</p>
-          <button onClick={() => setIsEditing(true)} className="mt-2 bg-blue-600 text-white px-3 py-1 rounded">Edit</button>
+          <button onClick={() => undefined} className="mt-2 bg-blue-600 text-white px-3 py-1 rounded">Edit</button>
         </>
       )}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/EditableItemCard.jsx:70:47
         <>
           <p>Price: ${item.price}</p>
           <p>Quantity: {item.quantity}</p>
-          <button onClick={() => setIsEditing(true)} className="mt-2 bg-blue-600 text-white px-3 py-1 rounded">Edit</button>
+          <button onClick={() => setIsEditing(false)} className="mt-2 bg-blue-600 text-white px-3 py-1 rounded">Edit</button>
         </>
       )}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared
