[Killed] StringLiteral
src/components/Login.jsx:7:44
 import { toast } from 'react-hot-toast';
 
 const Login = ({ onLogin }) => {
-  const [username, setUsername] = useState('');
+  const [username, setUsername] = useState("Stryker was here!");
   const [password, setPassword] = useState('');
   const navigate = useNavigate();
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:8:44
 
 const Login = ({ onLogin }) => {
   const [username, setUsername] = useState('');
-  const [password, setPassword] = useState('');
+  const [password, setPassword] = useState("Stryker was here!");
   const navigate = useNavigate();
   const [error, setError] = useState('');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Login.jsx:13:19
   const [error, setError] = useState('');
 
   // ✅ Redirect and toast if already logged in
-  useEffect(() => {
-    const token = localStorage.getItem('access_token');
-    if (token) {
-      toast.error("You are already logged in. Please log out first if you want to log in again.");
-      navigate('/myitems');
-    }
-  }, [navigate]);
+  useEffect(() => {}, [navigate]);
 
   const handleSubmit = async (e) => {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Login.jsx:15:16
   // ✅ Redirect and toast if already logged in
   useEffect(() => {
     const token = localStorage.getItem('access_token');
-    if (token) {
-      toast.error("You are already logged in. Please log out first if you want to log in again.");
-      navigate('/myitems');
-    }
+    if (token) {}
   }, [navigate]);
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Login.jsx:15:9
   // ✅ Redirect and toast if already logged in
   useEffect(() => {
     const token = localStorage.getItem('access_token');
-    if (token) {
+    if (false) {
       toast.error("You are already logged in. Please log out first if you want to log in again.");
       navigate('/myitems');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrayDeclaration
src/components/Login.jsx:19:6
       toast.error("You are already logged in. Please log out first if you want to log in again.");
       navigate('/myitems');
     }
-  }, [navigate]);
+  }, []);
 
   const handleSubmit = async (e) => {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Login.jsx:23:9
 
   const handleSubmit = async (e) => {
     e.preventDefault();
-    try {
-      const data = await loginUser({ username, password });
-
-      localStorage.setItem('access_token', data.access);
-      localStorage.setItem('refresh_token', data.refresh);
-      localStorage.setItem('username', username);
-
-      const base64Url = data.access.split('.')[1];
-      const base64 = base64Url.replace(/-/g, '+').replace(/_/g, '/');
-      const payload = JSON.parse(atob(base64));
-
-      const userObject = {
-        id: payload.user_id,
-        username: username
-      };
-
-      localStorage.setItem("user", JSON.stringify(userObject));
-
-      onLogin(username);
-
-      // ✅ Show toast success message
-      toast.success("✅ Logged in successfully!");
-
-      navigate('/');
-    } catch (err) {
+    try {} catch (err) {
       console.error("Login failed:", err);
       setError(err.message || 'Login failed');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:26:28
     try {
       const data = await loginUser({ username, password });
 
-      localStorage.setItem('access_token', data.access);
+      localStorage.setItem("", data.access);
       localStorage.setItem('refresh_token', data.refresh);
       localStorage.setItem('username', username);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:28:28
 
       localStorage.setItem('access_token', data.access);
       localStorage.setItem('refresh_token', data.refresh);
-      localStorage.setItem('username', username);
+      localStorage.setItem("", username);
 
       const base64Url = data.access.split('.')[1];
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:31:65
       localStorage.setItem('username', username);
 
       const base64Url = data.access.split('.')[1];
-      const base64 = base64Url.replace(/-/g, '+').replace(/_/g, '/');
+      const base64 = base64Url.replace(/-/g, '+').replace(/_/g, "");
       const payload = JSON.parse(atob(base64));
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:46:16
       // ✅ Show toast success message
       toast.success("✅ Logged in successfully!");
 
-      navigate('/');
+      navigate("");
     } catch (err) {
       console.error("Login failed:", err);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/Login.jsx:47:19
       toast.success("✅ Logged in successfully!");
 
       navigate('/');
-    } catch (err) {
-      console.error("Login failed:", err);
-      setError(err.message || 'Login failed');
-
-      // ❌ Show toast error message
-      toast.error("❌ Login failed. Please check your credentials.");
-    }
+    } catch (err) {}
   };
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/Login.jsx:48:21
 
       navigate('/');
     } catch (err) {
-      console.error("Login failed:", err);
+      console.error("", err);
       setError(err.message || 'Login failed');
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Login.jsx:49:16
       navigate('/');
     } catch (err) {
       console.error("Login failed:", err);
-      setError(err.message || 'Login failed');
+      setError(true);
 
       // ❌ Show toast error message
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/Login.jsx:49:16
       navigate('/');
     } catch (err) {
       console.error("Login failed:", err);
-      setError(err.message || 'Login failed');
+      setError(err.message && 'Login failed');
 
       // ❌ Show toast error message
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Login.jsx:61:10
       <div className="sm:mx-auto sm:w-full sm:max-w-sm">
         <img src="/image/logo.png" alt="logo" className="mx-auto h-10 w-auto" />
         <h2 className="mt-10 text-center text-2xl font-bold tracking-tight text-gray-900">Sign in to your account</h2>
-        {error && <p className="mt-2 text-red-600 text-sm text-center">{error}</p>}
+        {false}
       </div>
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/Login.jsx:61:10
       <div className="sm:mx-auto sm:w-full sm:max-w-sm">
         <img src="/image/logo.png" alt="logo" className="mx-auto h-10 w-auto" />
         <h2 className="mt-10 text-center text-2xl font-bold tracking-tight text-gray-900">Sign in to your account</h2>
-        {error && <p className="mt-2 text-red-600 text-sm text-center">{error}</p>}
+        {true}
       </div>
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared
