[Killed] ArrayDeclaration
src/components/MyItems.jsx:8:57
 const API_BASE_URL = import.meta.env.VITE_API_BASE_URL;
 
 const MyItems = () => {
-  const [inventory, setInventory] = useState({ on_sale: [], sold: [] });
+  const [inventory, setInventory] = useState({ on_sale: ["Stryker was here"], sold: [] });
   const [purchasedItems, setPurchasedItems] = useState([]);
   const [activeTab, setActiveTab] = useState('on_sale');
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:10:46
 const MyItems = () => {
   const [inventory, setInventory] = useState({ on_sale: [], sold: [] });
   const [purchasedItems, setPurchasedItems] = useState([]);
-  const [activeTab, setActiveTab] = useState('on_sale');
+  const [activeTab, setActiveTab] = useState("");
   const [notLoggedIn, setNotLoggedIn] = useState(false);
   const navigate = useNavigate();
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/MyItems.jsx:11:50
   const [inventory, setInventory] = useState({ on_sale: [], sold: [] });
   const [purchasedItems, setPurchasedItems] = useState([]);
   const [activeTab, setActiveTab] = useState('on_sale');
-  const [notLoggedIn, setNotLoggedIn] = useState(false);
+  const [notLoggedIn, setNotLoggedIn] = useState(true);
   const navigate = useNavigate();
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:14:33
   const [notLoggedIn, setNotLoggedIn] = useState(false);
   const navigate = useNavigate();
 
-  const fetchData = async () => {
-    const token = localStorage.getItem('access_token');
-    if (!token) {
-      setNotLoggedIn(true);
-      return;
-    }
-
-    try {
-      const inventoryRes = await fetch(`${API_BASE_URL}/api/user-inventory/`, {
-        headers: { Authorization: `Bearer ${token}` },
-      });
-      const inventoryData = await inventoryRes.json();
-
-      const purchaseRes = await fetch(`${API_BASE_URL}/api/user-purchases/`, {
-        headers: { Authorization: `Bearer ${token}` },
-      });
-      const purchaseData = await purchaseRes.json();
-
-      setInventory(inventoryData);
-      setPurchasedItems(purchaseData);
-    } catch (err) {
-      console.error("Error loading inventory or purchases:", err);
-    }
-  };
+  const fetchData = async () => {};
 
   useEffect(() => {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:15:40
   const navigate = useNavigate();
 
   const fetchData = async () => {
-    const token = localStorage.getItem('access_token');
+    const token = localStorage.getItem("");
     if (!token) {
       setNotLoggedIn(true);
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/MyItems.jsx:16:9
 
   const fetchData = async () => {
     const token = localStorage.getItem('access_token');
-    if (!token) {
+    if (token) {
       setNotLoggedIn(true);
       return;
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:16:9
 
   const fetchData = async () => {
     const token = localStorage.getItem('access_token');
-    if (!token) {
+    if (false) {
       setNotLoggedIn(true);
       return;
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BooleanLiteral
src/components/MyItems.jsx:17:22
   const fetchData = async () => {
     const token = localStorage.getItem('access_token');
     if (!token) {
-      setNotLoggedIn(true);
+      setNotLoggedIn(false);
       return;
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:21:9
       return;
     }
 
-    try {
-      const inventoryRes = await fetch(`${API_BASE_URL}/api/user-inventory/`, {
-        headers: { Authorization: `Bearer ${token}` },
-      });
-      const inventoryData = await inventoryRes.json();
-
-      const purchaseRes = await fetch(`${API_BASE_URL}/api/user-purchases/`, {
-        headers: { Authorization: `Bearer ${token}` },
-      });
-      const purchaseData = await purchaseRes.json();
-
-      setInventory(inventoryData);
-      setPurchasedItems(purchaseData);
-    } catch (err) {
+    try {} catch (err) {
       console.error("Error loading inventory or purchases:", err);
     }
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:22:40
     }
 
     try {
-      const inventoryRes = await fetch(`${API_BASE_URL}/api/user-inventory/`, {
+      const inventoryRes = await fetch(``, {
         headers: { Authorization: `Bearer ${token}` },
       });
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ObjectLiteral
src/components/MyItems.jsx:23:18
 
     try {
       const inventoryRes = await fetch(`${API_BASE_URL}/api/user-inventory/`, {
-        headers: { Authorization: `Bearer ${token}` },
+        headers: {},
       });
       const inventoryData = await inventoryRes.json();
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ObjectLiteral
src/components/MyItems.jsx:27:78
       });
       const inventoryData = await inventoryRes.json();
 
-      const purchaseRes = await fetch(`${API_BASE_URL}/api/user-purchases/`, {
-        headers: { Authorization: `Bearer ${token}` },
-      });
+      const purchaseRes = await fetch(`${API_BASE_URL}/api/user-purchases/`, {});
       const purchaseData = await purchaseRes.json();
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:34:19
 
       setInventory(inventoryData);
       setPurchasedItems(purchaseData);
-    } catch (err) {
-      console.error("Error loading inventory or purchases:", err);
-    }
+    } catch (err) {}
   };
 
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:35:21
       setInventory(inventoryData);
       setPurchasedItems(purchaseData);
     } catch (err) {
-      console.error("Error loading inventory or purchases:", err);
+      console.error("", err);
     }
   };
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:39:19
     }
   };
 
-  useEffect(() => {
-    fetchData();
-  }, []);
+  useEffect(() => {}, []);
 
   if (notLoggedIn) {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrayDeclaration
src/components/MyItems.jsx:41:6
 
   useEffect(() => {
     fetchData();
-  }, []);
+  }, ["Stryker was here"]);
 
   if (notLoggedIn) {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:43:7
     fetchData();
   }, []);
 
-  if (notLoggedIn) {
+  if (true) {
     return (
       <div className="container mx-auto p-4 text-center">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:43:20
     fetchData();
   }, []);
 
-  if (notLoggedIn) {
-    return (
-      <div className="container mx-auto p-4 text-center">
-        <h1 className="text-3xl font-bold text-red-600 mb-4">🔒 Access Denied</h1>
-        <p className="text-lg text-gray-700">
-          You need to{' '}
-          <span
-            className="text-blue-600 font-semibold cursor-pointer"
-            onClick={() => navigate('/login')}
-          >
-            log in
-          </span>{' '}
-          to view your items.
-        </p>
-      </div>
-    );
-  }
+  if (notLoggedIn) {}
 
   const renderContent = () => {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:48:23
       <div className="container mx-auto p-4 text-center">
         <h1 className="text-3xl font-bold text-red-600 mb-4">🔒 Access Denied</h1>
         <p className="text-lg text-gray-700">
-          You need to{' '}
+          You need to{""}
           <span
             className="text-blue-600 font-semibold cursor-pointer"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:51:22
           You need to{' '}
           <span
             className="text-blue-600 font-semibold cursor-pointer"
-            onClick={() => navigate('/login')}
+            onClick={() => undefined}
           >
             log in
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:51:37
           You need to{' '}
           <span
             className="text-blue-600 font-semibold cursor-pointer"
-            onClick={() => navigate('/login')}
+            onClick={() => navigate("")}
           >
             log in
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:54:19
             onClick={() => navigate('/login')}
           >
             log in
-          </span>{' '}
+          </span>{""}
           to view your items.
         </p>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:62:9
   }
 
   const renderContent = () => {
-    if (activeTab === 'on_sale') {
+    if (true) {
       return inventory.on_sale?.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] BlockStatement
src/components/MyItems.jsx:62:34
   }
 
   const renderContent = () => {
-    if (activeTab === 'on_sale') {
-      return inventory.on_sale?.length > 0 ? (
-        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
-          {inventory.on_sale.map((item) => (
-            <EditableItemCard
-              key={item.id}
-              item={item}
-              API_BASE_URL={API_BASE_URL}
-              refreshInventory={fetchData}
-            />
-          ))}
-        </div>
-      ) : (
-        <p className="text-center text-gray-500">No items on sale.</p>
-      );
-    }
+    if (activeTab === 'on_sale') {}
 
     if (activeTab === 'sold') {
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/MyItems.jsx:63:14
 
   const renderContent = () => {
     if (activeTab === 'on_sale') {
-      return inventory.on_sale?.length > 0 ? (
+      return inventory.on_sale?.length <= 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
           {inventory.on_sale.map((item) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:63:14
 
   const renderContent = () => {
     if (activeTab === 'on_sale') {
-      return inventory.on_sale?.length > 0 ? (
+      return true ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
           {inventory.on_sale.map((item) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:65:34
     if (activeTab === 'on_sale') {
       return inventory.on_sale?.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
-          {inventory.on_sale.map((item) => (
-            <EditableItemCard
-              key={item.id}
-              item={item}
-              API_BASE_URL={API_BASE_URL}
-              refreshInventory={fetchData}
-            />
-          ))}
+          {inventory.on_sale.map(() => undefined)}
         </div>
       ) : (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/MyItems.jsx:79:9
       );
     }
 
-    if (activeTab === 'sold') {
+    if (activeTab !== 'sold') {
       return inventory.sold?.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:79:9
       );
     }
 
-    if (activeTab === 'sold') {
+    if (true) {
       return inventory.sold?.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:80:14
     }
 
     if (activeTab === 'sold') {
-      return inventory.sold?.length > 0 ? (
+      return true ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
 {inventory.sold.map((item) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:80:14
     }
 
     if (activeTab === 'sold') {
-      return inventory.sold?.length > 0 ? (
+      return false ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
 {inventory.sold.map((item) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:82:21
     if (activeTab === 'sold') {
       return inventory.sold?.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
-{inventory.sold.map((item) => (
-  <div key={item.id} className="border rounded shadow bg-gray-100 overflow-hidden">
-    <img
-      src={item.image || '/image/Product1.jpg'}
-      alt={item.title}
-      className="w-full h-48 object-cover"
-    />
-    <div className="p-4">
-      <h3 className="font-bold text-lg">{item.title}</h3>
-      <p>{item.description}</p>
-      <p>Price: ${item.price}</p>
-      <p className="text-red-600 font-semibold">Sold Out</p>
-    </div>
-  </div>
-))}
+{inventory.sold.map(() => undefined)}
 
         </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:85:12
 {inventory.sold.map((item) => (
   <div key={item.id} className="border rounded shadow bg-gray-100 overflow-hidden">
     <img
-      src={item.image || '/image/Product1.jpg'}
+      src={true}
       alt={item.title}
       className="w-full h-48 object-cover"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] LogicalOperator
src/components/MyItems.jsx:85:12
 {inventory.sold.map((item) => (
   <div key={item.id} className="border rounded shadow bg-gray-100 overflow-hidden">
     <img
-      src={item.image || '/image/Product1.jpg'}
+      src={item.image && '/image/Product1.jpg'}
       alt={item.title}
       className="w-full h-48 object-cover"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:104:9
       );
     }
 
-    if (activeTab === 'purchased') {
+    if (true) {
       return purchasedItems.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/MyItems.jsx:104:9
       );
     }
 
-    if (activeTab === 'purchased') {
+    if (activeTab !== 'purchased') {
       return purchasedItems.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:105:14
     }
 
     if (activeTab === 'purchased') {
-      return purchasedItems.length > 0 ? (
+      return false ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
 {purchasedItems.map((item, index) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:105:14
     }
 
     if (activeTab === 'purchased') {
-      return purchasedItems.length > 0 ? (
+      return true ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
 {purchasedItems.map((item, index) => (
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:107:21
     if (activeTab === 'purchased') {
       return purchasedItems.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
-{purchasedItems.map((item, index) => (
-  <div key={`${item.id}-${index}`} className="border rounded shadow bg-white overflow-hidden">
-    <img
-      src={item.image || '/image/Product1.jpg'}
-      alt={item.title}
-      className="w-full h-48 object-cover"
-    />
-    <div className="p-4">
-      <h3 className="text-xl font-bold">{item.title}</h3>
-      <p className="text-gray-700">{item.description}</p>
-      <p>Quantity: <strong>{item.quantity}</strong></p>
-      <p className="text-blue-600 font-semibold">
-        Total: ${(item.price * item.quantity).toFixed(2)}
-      </p>
-    </div>
-  </div>
-))}
+{purchasedItems.map(() => undefined)}
 
         </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:108:13
       return purchasedItems.length > 0 ? (
         <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-4">
 {purchasedItems.map((item, index) => (
-  <div key={`${item.id}-${index}`} className="border rounded shadow bg-white overflow-hidden">
+  <div key={``} className="border rounded shadow bg-white overflow-hidden">
     <img
       src={item.image || '/image/Product1.jpg'}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:110:12
 {purchasedItems.map((item, index) => (
   <div key={`${item.id}-${index}`} className="border rounded shadow bg-white overflow-hidden">
     <img
-      src={item.image || '/image/Product1.jpg'}
+      src={false}
       alt={item.title}
       className="w-full h-48 object-cover"
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArithmeticOperator
src/components/MyItems.jsx:119:19
       <p className="text-gray-700">{item.description}</p>
       <p>Quantity: <strong>{item.quantity}</strong></p>
       <p className="text-blue-600 font-semibold">
-        Total: ${(item.price * item.quantity).toFixed(2)}
+        Total: ${(item.price / item.quantity).toFixed(2)}
       </p>
     </div>
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:139:20
       {/* Tab Buttons */}
       <div className="flex justify-center space-x-4 mb-6">
         <button
-          onClick={() => setActiveTab('on_sale')}
+          onClick={() => undefined}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'on_sale'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:139:39
       {/* Tab Buttons */}
       <div className="flex justify-center space-x-4 mb-6">
         <button
-          onClick={() => setActiveTab('on_sale')}
+          onClick={() => setActiveTab("")}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'on_sale'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:141:13
         <button
           onClick={() => setActiveTab('on_sale')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'on_sale'
+            false
               ? 'bg-green-600 text-white'
               : 'bg-white border border-green-600 text-green-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/MyItems.jsx:141:13
         <button
           onClick={() => setActiveTab('on_sale')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'on_sale'
+            activeTab !== 'on_sale'
               ? 'bg-green-600 text-white'
               : 'bg-white border border-green-600 text-green-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:143:17
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'on_sale'
               ? 'bg-green-600 text-white'
-              : 'bg-white border border-green-600 text-green-600'
+              : ""
           }`}
         >
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:149:20
           🛒 On Sale
         </button>
         <button
-          onClick={() => setActiveTab('sold')}
+          onClick={() => undefined}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'sold'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:149:39
           🛒 On Sale
         </button>
         <button
-          onClick={() => setActiveTab('sold')}
+          onClick={() => setActiveTab("")}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'sold'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:150:22
         </button>
         <button
           onClick={() => setActiveTab('sold')}
-          className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'sold'
-              ? 'bg-red-600 text-white'
-              : 'bg-white border border-red-600 text-red-600'
-          }`}
+          className={``}
         >
           ❌ Sold
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:151:13
         <button
           onClick={() => setActiveTab('sold')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'sold'
+            true
               ? 'bg-red-600 text-white'
               : 'bg-white border border-red-600 text-red-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:151:13
         <button
           onClick={() => setActiveTab('sold')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'sold'
+            false
               ? 'bg-red-600 text-white'
               : 'bg-white border border-red-600 text-red-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:152:17
           onClick={() => setActiveTab('sold')}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'sold'
-              ? 'bg-red-600 text-white'
+              ? ""
               : 'bg-white border border-red-600 text-red-600'
           }`}
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] StringLiteral
src/components/MyItems.jsx:153:17
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'sold'
               ? 'bg-red-600 text-white'
-              : 'bg-white border border-red-600 text-red-600'
+              : ""
           }`}
         >
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ArrowFunction
src/components/MyItems.jsx:159:20
           ❌ Sold
         </button>
         <button
-          onClick={() => setActiveTab('purchased')}
+          onClick={() => undefined}
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'purchased'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] ConditionalExpression
src/components/MyItems.jsx:161:13
         <button
           onClick={() => setActiveTab('purchased')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'purchased'
+            false
               ? 'bg-blue-600 text-white'
               : 'bg-white border border-blue-600 text-blue-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Killed] EqualityOperator
src/components/MyItems.jsx:161:13
         <button
           onClick={() => setActiveTab('purchased')}
           className={`px-4 py-2 rounded font-medium ${
-            activeTab === 'purchased'
+            activeTab !== 'purchased'
               ? 'bg-blue-600 text-white'
               : 'bg-white border border-blue-600 text-blue-600'
killedBy: All tests
statusReason: Running 13 tests using 1 worker



✅ Navigated to /populate-db

🧹 DB cleared

[Survived] StringLiteral
src/components/MyItems.jsx:163:17
           className={`px-4 py-2 rounded font-medium ${
             activeTab === 'purchased'
               ? 'bg-blue-600 text-white'
-              : 'bg-white border border-blue-600 text-blue-600'
+              : ""
           }`}
         >
